Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/installer-omegat.tmx
Source language: en_us
Languages: pt_br

source: Your First Cup: An Introduction to the Java EE Platform provides detailed instructions for compiling and running your first program
pt_br: Seu primeiro contato: Uma introdução a plataforma Java EE que provê informações detalhadas para você compilar e executar seu primeiro aplicativo

source: Complete tool set for creating Ruby and Ruby on Rails applications.
pt_br: Ferramenta completa para a criação de aplicações Ruby e Ruby on Rail.

source: Includes JRuby interpreter, Ruby on Rails framework, powerful editor, debugger, gem manager, and interactive Ruby shell.
pt_br: inclue interpretador JRuby, framework Ruby on Rails, super editor, depurador, gerenciador, e interatividade do Ruby com shell.

source: Supports easily creating, modifying, and running Ruby on Rails applications.
pt_br: Suporta fácil criação, modificação, e execução de aplicações Ruby on Rails.

source: Sun Java(TM) Wireless Toolkit {display-version} for CLDC
pt_br: Sun Java(TM) Wireless Toolkit {display-version} para CLDC

source: Running Open ESB installer
pt_br: Executando instalador do Open ESB

source: Running Open ESB uninstaller
pt_br: Executando desinstalador do Open ESB

source: Failed to run Open ESB installer
pt_br: Falha ao executar o instalador do Open ESB

source: Failed to run Open ESB uninstaller
pt_br: Falha ao executar o desinstalador do Open ESB

source: Open ESB implements an Enterprise Service Bus (ESB) runtime using Java Business Integration (JBI) as the foundation.
pt_br: Open ESB implementa em tempo de execução um Enterprise Service Bus (ESB) usando Java Business Integration (JBI) como fundação.

source: Open ESB is an open standard, open-source product that offers a platform to build integration solutions based on service-oriented architecture (SOA).
pt_br: Open ESB é um produto de código-fonte aberto, que oferece uma plataforma para contruir soluções com integração baseada no serviço orientado a arquitetura (SOA).

source: Tools for developing C and C++ applications.
pt_br: Ferramentas para desenvolvimento de aplicações C e C++.

source: Includes project templates, support for existing projects, advanced editor, debug support, and makefile wizard for configuration management.
pt_br: Inclue projetos modelo, suporte a projetos existentes, editor avançado, suporte a depuração, e assistente para gerenciamento de configurações.

source: Adding options to the IDE configuration files for the proper work of UML
pt_br: Adicionando opções para o IDE nos arquivos de configuração para o trabalho de UML

source: Integrate with Telelogic Doors
pt_br: Integrar com Telelogic Doors

source: Failed to add options to the IDE configuration files for the proper work of UML
pt_br: Falha ao adicionar as opções nos arquivos de configuração do IDE para o trabalho de UML

source: Failed to integrate with Telelogic Doors
pt_br: Falha ao integrar com o Telelogic Doors

source: Removing options, that UML used, from IDE configuration files
pt_br: Removendo opções, que são usadas pelo UML, dos arquivos de configuração do IDE

source: Canceling Telelogic Doors integration
pt_br: Cancelando integração com Telelogic Doors

source: Failed to remove UML-specific options from IDE configuration files
pt_br: Falha ao remover opções específicas de UML dos arquivos de configuração do IDE

source: Failed to cancel Telelogic Doors integration
pt_br: Falha ao cancelar a integração com Telelogic Doors

source: Unified Modeling Language tools that support drawing design diagrams, generating code, and automatic creation of design diagrams from existing code.
pt_br: Ferramentas da Linguagem de Modelagem Unificada que suportam desenho de diagramas, geração de código, e criação automática de design de diagramas de código existente.

source: Running WSRP installer
pt_br: Executando instalador do WSRP

source: Failed to run WSRP installer
pt_br: Falha ao executar o instalador do WSRP

source: Web Services for Remote Portlets {display-version}
pt_br: Serviços Web para Portlets Remotos {display-version}

source: Web Services for Remote Portlets {display-version} is a standard that provides web service-based access capability to portlets and enables interoperability among different portal server solutions.
pt_br: Serviços Web para Portlets Remotos {display-version} é um padrão que oferece serviço web baseado em acesso de capacidade para portlets e permite a interoperabilidade entre as diferentes soluções do servidor.

source: WSRP is a presentation-oriented web service.
pt_br: WSRP é uma apresentação orientada para serviço web.

source: Unlike common web services that carry only the raw data as the result of a request, a WSRP response carries fully rendered markup to be included within a portal page.
pt_br: Diferentemente comum de serviços web que procedem apenas dos dados brutos como o resultado de um pedido, uma resposta WSRP exerçe plenamente a prestação de marcação para ser incluído dentro de uma página..

source: JDK installation finished with error code {0}
pt_br: A instalação do JDK foi finalizada com o código de erro {0}

source: JRE installation finished with error code {0}
pt_br: Instalação da JRE foi finalizada com o código de erro {0}

source: JDK uninstallation finished with error code {0}
pt_br: A desinstalação do JDK foi finalizada com o código de erro {0}

source: JRE uninstallation finished with error code {0}
pt_br: A desinstalação da JRE foi finalizada com o código de erro {0}

source: Running JDK installer...
pt_br: Executando instalador do JDK...

source: Running JRE installer...
pt_br: Executando instalador do JRE...

source: Running JDK uninstaller...
pt_br: Executando o desinstalador do JDK...

source: Running JRE uninstaller...
pt_br: Executando o desinstalador do JRE...

source: An error occured while JDK installation
pt_br: Um erro ocorreu durante a instalação do JDK

source: An error occured while JDK uninstallation
pt_br: Um erro ocorreu durante a desinstalação do JDK

source: An error occured while JRE installation
pt_br: Um erro ocorreu durante a instalação do JRE

source: An error occured while JRE uninstallation
pt_br: Um erro ocorreu durante a desinstalação da JRE

source: Cannot move installation files
pt_br: Não foi possível mover os arquivos de instalação

source: Java SE Developer Kit (JDK) {display-version} Installation
pt_br: Instalação do Kit de Desenvolvimento Java SE (JDK) {display-version}

source: Choose the installation folder for JDK
pt_br: Selecione a pasta de instalação para o JDK

source: &Install the JDK™ to:
pt_br: &Instalar o JDK™ em:

source: JDK cannot be installed in directory with spaces.
pt_br: O JDK nçao pode ser instalado em diretórios com espaços.

source: The Java SE Development Kit (JDK) includes the Java Runtime Environment (JRE) and command-line development tools that are useful for developing applets and applications.
pt_br: O Kit de Desenvolvimento Java SE (JDK) inclui o ambiente de execução Java (JRE) e ferramentas de desenvolvimento de linha de comando, úteis para o desenvolvimento de applets e aplicações.

source: The Java BluePrints series defines the application programming model for end-to-end solutions using Java technology.
pt_br: A série Java BluePrints define o modelo de programação de aplicação para soluções do início ao fim utilizando tecnologia Java .

source: The series contains guidelines, patterns, and code for real-world application scenarios, enabling you to build robust, scalable, and portable solutions.
pt_br: A série contém orientações, padrões, e códigos para aplicações no cenário do mundo real, possibilitando a você construir soluções robustas, escaláveis e portáveis.

source: All the code and applications included in these blueprints are NetBeans-ready.
pt_br: Todos os códigos e aplicações incluídas nesta matriz estão prontas para o NetBeans.

source: Summary
pt_br: Sumário

source: Click Install to start the installation.
pt_br: Clique em Instalar para iniciar a instalação.

source: Click Uninstall to start the uninstallation.
pt_br: Clique em Desinstalar para iniciar a desinstalação.

source: {0} Installation Folder:
pt_br: {0} Pasta de Instalação:

source: NetBeans IDE Installation Folder:
pt_br: Pasta de Instalação do IDE NetBeans:

source: The following components will be uninstalled:
pt_br: Os seguintes componentes irão ser removidos:

source: Total Installation Size:
pt_br: Tamanho total da Instalação:

source: Total Download Size:
pt_br: Tamanho Total do Download:

source: {0} will be installed to the GlassFish folder.
pt_br: {0} irá ser instalado na pasta do GlassFish.

source: {0} will be installed to the NetBeans IDE folder.
pt_br: {0} irá ser instalado na pasta do IDE NetBeans IDE.

source: <html><br>Runtimes to remove with {0}:
pt_br: <html><br>Runtimes para remover com {0}:

source: &Install
pt_br: &Instalar

source: &Uninstall
pt_br: &Desinstalar

source: Insufficient disk space for proper installation.
pt_br: Espaço insuficiente para a instalação apropriada.

source: Additional {1} is required in {0}.
pt_br: {1} adicionais é necessário em {0}.

source: Cannot check the free disk space
pt_br: Não foi possível analisar o espaço livre no disco

source: Could not access product's configuration logic
pt_br: Não foi possível acessar a configuração lógica dos produtos

source: Cannot get the list of file system roots
pt_br: Não é possível obter a lista do sistema de arquivos raiz

source: {0} is set up to be installed to {1} which does not belong to any of the file system roots.
pt_br: {0} deve ser instalado em {1}, que não pertence a nada do sistema de arquivos raiz.

source: The wizard does not have write access to {1}, the installation directory of {0}.
pt_br: O Assistente não tem acesso de escrita para {1}, o diretório de instalação de {0}.

source: Please correct the permissions before proceeding.
pt_br: Por favor, corrija as permissões antes de continuar.

source: Setup Complete
pt_br: Instalação completa

source: Click Finish to finish the NetBeans IDE setup.
pt_br: Clique em Finalizar para finalizar a instalação do IDE NetBeans.

source: <html><b>Installation completed successfully.</b></html>
pt_br: <html><b>Instalação concluída com sucesso.</b></html>

source: <html><span color="red">Warnings were encountered during the installation.</b><br><br>For more details consult the installation log file:<br>{0}</span></html>
pt_br: <html><span color="red">Advertências foram encontrados durante a instalação.</b><br><br>Para maiores detalhes consulte o log de instalação:<br>{0}</span></html>

source: <html><span color="red"><b>Errors were encountered during the installation.</b></span><br><br>For more details consult the installation log file:<br>{0}</span></html>
pt_br: <html><span color="red"><b>Erros foram encontrados durante a instalação.</b></span><br><br>Para maiores detalhes consulte o log de instalação:<br>{0}</span></html>

source: To launch the IDE, use either the Start menu or the NetBeans desktop icon.
pt_br: Para iniciar o IDE, use o menu Iniciar ou o ícone do IDE NetBeans no desktop.

source: To change installed components and add NetBeans plugins, use Plugin Manager that is an integral part of NetBeans IDE.
pt_br: Para alterar componentes instalados e adicionar plugins do NetBeans, use o Gerenciador de Plugin que é uma parte integrada do IDE NetBeans.

source: To launch the IDE, use the NetBeans desktop icon.
pt_br: Para iniciar o IDE, use o ícone do NetBeans no desktop.

source: To launch the IDE, use the NetBeans dock icon.
pt_br: Para iniciar o IDE, utilize o ícone do NetBeans.

source: Java SE Development Kit
pt_br: Kit de Desenvolvimento Java SE

source: <html>Register the {0} to get the following benefits:<br><ul><li>Notification of new versions, patches and updates</li><li>Special offers on Sun developer products, services and training</li><li>Access to early releases and documentation</li><li>Ability to track and manage your registered products on the SunConnection Inventory site</li></ul>Registration is FREE.
pt_br: <html>Registre o {0} para ter os seguintes benefícios:<br><ul><li>Notificação de novas versões, correções e atualizações</li><li>Ofertas especiais em produtos, serviços e treinamentos Sun para desenvolvedores</li><li>Acesso antecipado à lançamentos e documentações</li><li>Possibilidade de rastrear e gerenciar seus produtos registrados no site SunConnection Inventory</li></ul>O registro é gratuito.

source: Register the {0} after finishing the installer
pt_br: Registre o {0} após o término da instalação

source: <html>Uninstallation completed successfully.</html>
pt_br: <html>Desinstalação concluída com sucesso.</html>

source: <html><span color="red">Warnings were encountered during the uninstallation.<br><br>For more details consult the installation log file:<br>{0}</span></html>
pt_br: <html><span color="red">Advertências foram encontradas durante a desinstalação.<br><br>Para maiores detalhes consulte o log de instalação:<br>{0}</span></html>

source: <html><span color="red">Errors were encountered during the uninstallation.<br><br>For more details consult the installation log file:<br>{0}</span></html>
pt_br: <html><span color="red">Erros foram encontrados durante a desinstalação.<br><br>Para maiores detalhes consulte o log de instalação:<br>{0}</span></html>

source: <br><br>Some files could not be removed from the installation directories of the {0}.
pt_br: <br><br>Alguns arquivos não puderam ser removidos dos diretórios de instalação em {0}.

source: You may need to remove them manually.
pt_br: Você deverá removê-los manualmente.

source: &Finish
pt_br: &Finalizar

source: <html><h2 style="color: #FF8E00; bold">Welcome to the NetBeans IDE 6.0.1 Installer
pt_br: <html><h2 style="color: #FF8E00; bold">Bem-vindo ao instalador do IDE NetBeans 6.0.1

source: <html><h2 style="color: #FF8E00; bold">Welcome to the NetBeans IDE 6.0.1 and {0} Installer
pt_br: <html><h2 style="color: #FF8E00; bold">Bem-vindo ao instalador do IDE NetBeans 6.0.1 e {0}

source: The installer will install the NetBeans IDE with the following packs and runtimes.<br>Click Customize to select the packs and runtimes to install.<br><br>
pt_br: O Instalador irá instalar o IDE NetBeans com os seguintes pacotes e runtimes.<br>Clique em Personalizar para selecionar os pacotes e runtimes.<br><br>

source: The installer will install the NetBeans IDE with the Mobility pack.<br>
pt_br: O Instalador irá instalar o IDE NetBeans com o pacote Mobilidade.<br>

source: The installer will install the NetBeans IDE with the Java SE pack.<br>
pt_br: O Instalador irá instalar o IDE NetBeans com o pacote Java SE.<br>

source: The installer will install the NetBeans IDE with the Web & Java EE pack and selected application servers.<br><br>Select the application servers to install with the IDE:<br><br>
pt_br: O instalador irá instalar o IDE NetBeans com o pacote Web e Java EE e servidores de aplicação selecionados.<br><br>Selecione os servidores de aplicação para instalar com o IDE:<br><br>

source: The installer will install the NetBeans IDE with the Ruby pack.<br>
pt_br: O instalador irá instalar o IDE NetBeans com o pacote Ruby.<br>

source: The installer will install the NetBeans IDE with the C/C++ pack.<br>
pt_br: O instalador irá instalar o IDE NetBens com o pacote C/C++.<br>

source: The installer will install NetBeans IDE and Java SE Development Kit (JDK).<br>Click Customize to select the packs and runtimes to install.<br><br>
pt_br: O instalador irá instalar o NetBeans IDE e o Java SE Development Kit (JDK).<br>Clique em Personalizar para selecionar os pacotes e runtimes.<br><br>

source: The installer will install NetBeans IDE and Java SE Development Kit (JDK).<br>
pt_br: O instalador irá instalar o NetBeans IDE e o Java SE Development Kit (JDK).<br>

source: The installer will install NetBeans IDE and Java SE Development Kit (JDK).<br><br>Select the application servers to install with the IDE:<br><br>
pt_br: O instalador irá instalar o NetBeans IDE e o Java SE Development Kit (JDK).<br>Selecione os servidores de aplicação para instalar com o IDE:<br><br>

source: This account does not have sufficient privileges to install Java™.<br>Please login to an account with administrative permissions.
pt_br: Esta conta não tem privilégios suficientes para instalar o Java™.<br>Favor autenticar com uma conta com privilégios administrativos.

source: {0} is already installed.
pt_br: {0} já instalado.

source: Click next if you want to proceed with NetBeans IDE installation.
pt_br: Clique em próximo se desejar proceder com a instalação do NetBeans IDE.

source: NetBeans IDE {display-version} and {0} are already installed.<br>Click Cancel to exit the installation.
pt_br: NetBeans IDE {display-version} e {0} já instalados.<br>Clique em Cancelar para sair da instalação.

source: This account does not have sufficient privileges to install Java™.<br>Please login to an account with administrative permissions.<br>NetBeans IDE {display-version} is already installed.<br>Click Cancel to exit the installation.
pt_br: Esta conta não tem privilégios suficientes para instalar o Java™.<br>Favor autenticar com uma conta com privilégios administrativos.<br>NetBeans IDE {display-version} e {0} já instalados.<br>Clique em Cancelar para sair da instalação.

source: NetBeans IDE {display-version} is already installed.<br>Click next if you want to proceed with JDK installation.
pt_br: NetBeans IDE {display-version} já instalado.<br>Clique em próximo se desejar proceder com a instalação.

source: {0} <span style="color: gray">(Already Installed)</span><br>
pt_br: {0} <span style="color: gray">(Já instalado)</span><br>

source: &Customize...
pt_br: &Personalizar...

source: Installation Size: {0}
pt_br: Tamanho da Instalação: {0}

source: Customize Installation
pt_br: Personalizar Instalação

source: &Select packs and runtimes to install from the list below, unselect those you want to uninstall.
pt_br: &Selecione os pacotes e runtimes da lista para instalar, desmarque todos que você quer remover.

source: &Select packs and runtimes to install from the list below.
pt_br: &Selecione os pacotes e runtimes para instalar na lista.

source: Un&select packs and runtimes to uninstall from the list below.
pt_br: De&marque os pacotes e runtimes da lista.

source: Installation size: {0} Download Size: {1}
pt_br: Tamanho da instalação: {0} Tamanho do Download: {1}

source: Installation size: {0}
pt_br: Tamanho da instalação: {0}

source: Select a component to see its description.
pt_br: Selecione um componente para ver sua descrição.

source: Cancel
pt_br: Cancelar

source: You did not select anything to install or uninstall.
pt_br: Você não selecionou nada para instalar ou remover.

source: Select at least one pack or runtime for installation or uninstallation.
pt_br: Selecione pelo menos um pacote ou runtime para instalar ou remover.

source: You did not select anything to install.
pt_br: Você não selecionou nada para instalar.

source: Select at least one pack or runtime for installation.
pt_br: Selecione pelo menos um pacote ou runtime para instalação.

source: You did not select anything to uninstall.
pt_br: Você não selecionou nada para remover.

source: Select at least one pack or runtime for uninstallation.
pt_br: Selecione pelo menos um pacote ou runtime para remover.

source: {1} is required to install {0}.
pt_br: {1} é necessário para instalar {0}.

source: {0} conflicts with {1}.
pt_br: {0} entra em conflito com {1}.

source: {0} is required by {1}.
pt_br: {0} é necessário para {1}.

source: Insufficient disk space for downloading the installation data.
pt_br: Espaço em disco insuficiente para baixar os dados da instalação.

source: Insufficient disk space for extracting the installation data.
pt_br: Espaço em disco insuficiente para extrair os dados da instalação.

source: All of the available components are already installed.
pt_br: Todos os componentes disponíveis já estão instalados.

source: Click Cancel to exit the installer.
pt_br: Clique em Cancelar para finalizar o instalador.

source: Description
pt_br: Descrição

source: {0} (Already Installed)
pt_br: {0} (Já instalado)

source: Configuring the Installer...
pt_br: Configurando o instalador...

source: Please wait while NetBeans IDE installer initializes
pt_br: Por favor, aguarde enquando o instalador do IDE NetBeans inicializa

source: NetBeans IDE 6.0.1 Installer
pt_br: Instalador do NetBeans IDE 6.0.1

source: Installation
pt_br: Instalação

source: Please wait while the installer installs NetBeans IDE and runtimes.
pt_br: Por favor, aguarde enquanto o instalador instala o IDE NetBeans.

source: It appears that the following instance of the NetBeans IDE is still running: {0} A lock file exists at {1} Please close this NetBeans IDE prior to continuing with uninstallation.
pt_br: Aparentemente a seguinte instância do IDE NetBeans ainda está em execução: {0} Um arquivo travado existe em {1} Por favor, feche o IDE NetBeans antes de continuar com a desinstalação.

source: The NetBeans branding cluster does not exist
pt_br: O cluster marca NetBeans não existe

source: Can`t get netbeans userdir from {0}
pt_br: Não foi possível obter o diretório do usuário de {0}

source: Failed to execute the JDK verification procedure
pt_br: Falha ao executar o procedimento de verificação do JDK

source: Cannot delete {0}
pt_br: Não foi possível remover {0}

source: Cannot download TestJDK.class from {0}
pt_br: Não foi possível baixar TestJDK.class de {0}

source: Cannot canonize {0}
pt_br: Não foi possível canonizar {0}

source: Cannot configure parser
pt_br: Não foi possível configurar o analisador

source: Cannot configure transformer
pt_br: Não foi possível configurar o transformador

source: Something wrong with transformer
pt_br: Algum erro ocorreu com o transformador

source: Something wrong while parsing
pt_br: Algum erro ocorreu durante a análise

source: Could not create domain - failed to create the password file.
pt_br: Não foi possível criar o domínio - falha ao criar o arquivo de senhas.

source: "Could not create domain - error {0} occurred.
pt_br: "Não foi possível criar o domínio - o erro {0} ocorreu.

source: Could not create domain - the process returned {0}
pt_br: Não foi possível criar o domínio - o processo retornou {0}

source: Could not create domain - the process was killed due to timeout.
pt_br: Não foi possível criar o domínio - o processo foi finalizado devido ao tempo esgotado.

source: Deployment failed to finish in a timely manner
pt_br: Implatação não conseguiu terminar de forma atempada

source: Adding {0} to the active clusters list
pt_br: Adicionando {0} a lista de clusters ativa

source: Adding {0} to the 'productid' file
pt_br: Adicionando {0} para o arquivo 'productid'

source: Removing {0} from the productid file
pt_br: Removendo {0} do arquivo productid

source: Removing {0} from the active clusters list
pt_br: Removendo {0} da lista de clusters ativa

source: Cannot add {0} to the active clusters list
pt_br: Não foi possível adicionar {0} a lista de clusters ativa

source: Cannot add {0} to the 'productid' file
pt_br: Não foi possível adicionar {0} ao arquivo 'productid'

source: Cannot remove {0} from the 'productid' file
pt_br: Não foi possível remover {0} do aruqivo 'productid'

source: Cannot remove {0} from the active clusters list
pt_br: Não foi possível remover {0} da lista de clusters ativa

source: The installation directory {0} is missing.
pt_br: A instalação do diretório {0} está ausente.

source: Most likely it was deleted manually.
pt_br: Mais provável que foi excluído manualmente.

source: The installation directory {0} is in fact a file.
pt_br: A instalação do diretório {0} é de fato um arquivo.
